<details ><summary>apply for staging 2025-03-30 00:27:49 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform-cicd#staging has been locked by PR #2
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_policy.read_only_ecr_access must be replaced
-/+ resource "aws_iam_policy" "read_only_ecr_access" {
      ~ arn         = "arn:aws:iam::544690439995:policy/read-only-ecr-access" -> (known after apply)
      ~ id          = "arn:aws:iam::544690439995:policy/read-only-ecr-access" -> (known after apply)
      ~ name        = "read-only-ecr-access" -> "read-only-ecr-access-renamed" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAX5UQUQ45QXHRBTNCK" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.ecr_access_attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecr_access_attachment" {
      ~ id         = "ecr-access-20250330002258981600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::544690439995:policy/read-only-ecr-access" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
aws_iam_role_policy_attachment.ecr_access_attachment: Destroying... [id=ecr-access-20250330002258981600000001]
aws_iam_role_policy_attachment.ecr_access_attachment: Destruction complete after 1s
aws_iam_policy.read_only_ecr_access: Destroying... [id=arn:aws:iam::544690439995:policy/read-only-ecr-access]
aws_iam_policy.read_only_ecr_access: Destruction complete after 0s
aws_iam_policy.read_only_ecr_access: Creating...
aws_iam_policy.read_only_ecr_access: Creation complete after 0s [id=arn:aws:iam::544690439995:policy/read-only-ecr-access-renamed]
aws_iam_role_policy_attachment.ecr_access_attachment: Creating...
aws_iam_role_policy_attachment.ecr_access_attachment: Creation complete after 0s [id=ecr-access-20250330002810068800000001]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.

```
</details>

</details>